In [1]:
    import numpy as np
    import pandas as pd
    from numpy.random import randn
    from numpy.linalg import inv,qr, eig ,det ,svd

    import matplotlib.pyplot as plt
    import random

    from pandas import DataFrame , Series

## Series

In [4]:
obj = Series([4,7,-5,3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [8]:
obj.values

array([ 4,  7, -5,  3])

In [2]:
obj2 = Series([4,7,-5,3],index=['a','b',"c",'d'])

In [10]:
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [12]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [13]:
obj2[obj2>0]

a    4
b    7
d    3
dtype: int64

In [14]:
'b' in obj2

True

In [3]:
obj2_dict = obj2.to_dict()

In [4]:
obj2_dict

{'a': 4, 'b': 7, 'c': -5, 'd': 3}

In [5]:
obj2 = Series(obj2_dict)
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [7]:
'a' in obj2

True

In [10]:
sdata = {'aa':12,"dfas":444,"sag":13,'hh':68}

In [11]:
sdata

{'aa': 12, 'dfas': 444, 'hh': 68, 'sag': 13}

In [12]:
obj3 = Series(sdata)

In [13]:
obj3

aa       12
dfas    444
hh       68
sag      13
dtype: int64

In [32]:
states = list(sdata.keys())

In [33]:
states.remove('hh')
states.append('kk')

In [34]:
obj4 = Series(sdata ,index = states)

In [35]:
obj4

dfas    444.0
aa       12.0
sag      13.0
kk        NaN
dtype: float64

In [36]:
pd.isnull(obj4)

dfas    False
aa      False
sag     False
kk       True
dtype: bool

In [37]:
obj4.isnull()

dfas    False
aa      False
sag     False
kk       True
dtype: bool

In [38]:
obj3

aa       12
dfas    444
hh       68
sag      13
dtype: int64

In [42]:
print(obj4.name)

None

In [43]:
obj4.name = 'obj4'

In [44]:
print(obj4.name)

obj4

In [45]:
obj4.index

Index(['dfas', 'aa', 'sag', 'kk'], dtype='object')

In [46]:
obj4.index.name

In [47]:
obj4.index.name  = 'obj4_index'

## DataFrame

In [2]:
data = {'state':['ohio','ohio','ohio','nevada','nevada'],
        'year':[2000,2001,2002,2001,2002],
        'pop':[1.5,1.7,3.6,2.4,2.9]
       }

In [3]:
data

{'pop': [1.5, 1.7, 3.6, 2.4, 2.9],
 'state': ['ohio', 'ohio', 'ohio', 'nevada', 'nevada'],
 'year': [2000, 2001, 2002, 2001, 2002]}

In [4]:
frame = DataFrame(data)

In [5]:
frame

   pop   state  year
0  1.5    ohio  2000
1  1.7    ohio  2001
2  3.6    ohio  2002
3  2.4  nevada  2001
4  2.9  nevada  2002

In [6]:
frame.state.name = 'test'

In [7]:
frame #changing  column name can't reflect on frame columns

   pop   state  year
0  1.5    ohio  2000
1  1.7    ohio  2001
2  3.6    ohio  2002
3  2.4  nevada  2001
4  2.9  nevada  2002

In [8]:
DataFrame(data, columns = [1,2,3])#没有这三列

Empty DataFrame
Columns: [1, 2, 3]
Index: []

In [9]:
DataFrame(data, columns = [])

Empty DataFrame
Columns: []
Index: []

In [11]:
frame['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
Name: pop, dtype: float64

## 使用ix找到行

In [15]:
frame.ix[0]

pop       1.5
state    ohio
year     2000
Name: 0, dtype: object

In [16]:
frame['debt'] = 16.5

In [17]:
frame

   pop   state  year  debt
0  1.5    ohio  2000  16.5
1  1.7    ohio  2001  16.5
2  3.6    ohio  2002  16.5
3  2.4  nevada  2001  16.5
4  2.9  nevada  2002  16.5

In [18]:
np.arange(5.)

array([ 0.,  1.,  2.,  3.,  4.])

In [19]:
frame['debt'] = np.arange(5)

In [20]:
frame

   pop   state  year  debt
0  1.5    ohio  2000     0
1  1.7    ohio  2001     1
2  3.6    ohio  2002     2
3  2.4  nevada  2001     3
4  2.9  nevada  2002     4

## Series 有索引 并且按照索引创建列

In [22]:
val = Series([1,2,5.6] , index=[2,3,5])

In [23]:
frame['debt_'] = val

In [24]:
frame

   pop   state  year  debt  debt_
0  1.5    ohio  2000     0    NaN
1  1.7    ohio  2001     1    NaN
2  3.6    ohio  2002     2    1.0
3  2.4  nevada  2001     3    2.0
4  2.9  nevada  2002     4    NaN

In [25]:
need_to_compare_val = Series([1,2,3])

In [26]:
val == need_to_compare_val

ValueError: Can only compare identically-labeled Series objects

In [27]:
need_to_compare_val = Series([1,2,3],index =[1,2,3])

In [28]:
val == need_to_compare_val

ValueError: Can only compare identically-labeled Series objects

* an only compare identically-labeled Series objects
* 必须完全相等的index才能比较

In [29]:
val == val

2    True
3    True
5    True
dtype: bool

In [30]:
need_to_compare_val.index = [2,3,5]

In [31]:
val == need_to_compare_val

2     True
3     True
5    False
dtype: bool

In [32]:
val[_]

2    1.0
3    2.0
dtype: float64

## 等长不等index的单列的Frame进行比较

In [35]:
val = DataFrame([1,2,5.6] , index=[2,3,5])

In [36]:
val

     0
2  1.0
3  2.0
5  5.6

In [37]:
val1 = DataFrame([14,27,56] , index=[1,2,3])

In [38]:
val1

    0
1  14
2  27
3  56

In [41]:
val [val1]

ValueError: Must pass DataFrame with boolean values only

* 切片传进去的是布尔值坐标

## 比较两个DataFrame的条件

In [48]:
val_ = DataFrame({0:[14,27,56],1:[1,2,3]} , index=[2,3,5])

In [49]:
val_

    0  1
2  14  1
3  27  2
5  56  3

In [50]:
val

     0
2  1.0
3  2.0
5  5.6

In [55]:
val  == val_[0].to_frame()

       0
2  False
3  False
5  False

## 根据布尔值索引判断选中的行

In [57]:
val_

    0  1
2  14  1
3  27  2
5  56  3

In [61]:
type(val  == val_[0].to_frame())

pandas.core.frame.DataFrame

In [64]:
val_[0] == 14

2     True
3    False
5    False
Name: 0, dtype: bool

In [84]:
val_[Series([True,True,False],index=[2,3,5])]

    0  1
2  14  1
3  27  2

In [85]:
val_[Series([True,True,False],index=[1,3,5])]

/home/zhanghui/py35/lib/python3.5/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match

* 应用boolean序列的时候 ， 索引必须完全相同

In [90]:
val_[0].to_frame()[Series([True,True,False],index=[1,3,5]).to_frame()]

      0
2   NaN
3  27.0
5   NaN

* 除非被筛选的是单列

## 新列被赋予以一个Series

In [94]:
val_

    0  1
2  14  1
3  27  2
5  56  3

In [95]:
val_['wo'] = Series([1,2,3], index =[1,2,3])

In [97]:
val_

    0  1   wo
2  14  1  2.0
3  27  2  3.0
5  56  3  NaN

* 按照索引配给值

## 嵌套字典的输入

In [2]:
pop = {'Nevada':{2001:2.4,2002:2.9}, 'Ohio':{2000:1.5 ,2001:1.7,2002:3.6}}

In [3]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [4]:
frame3 = DataFrame(pop)

In [5]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [6]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [7]:
DataFrame(pop , index= [2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [8]:
pdata = {
    'Ohio':frame3['Ohio'][:-1] , 
    'Nevada':frame3['Nevada'][:2]  
    
}

In [9]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [10]:
frame3.index.name = 'index'
frame3.columns.name = 'state'

In [12]:
frame3

state  Nevada  Ohio
index
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [13]:

frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

## 索引对象

In [14]:
obj = Series(range(3) , index=['a','b','c'])

In [16]:
index = obj.index

In [17]:
index

Index(['a', 'b', 'c'], dtype='object')

In [18]:
index = pd.Index(np.arange(3))

In [19]:
index

Int64Index([0, 1, 2], dtype='int64')

In [20]:
obj = Series([1,2.4,3],index = index)

In [21]:
obj

0    1.0
1    2.4
2    3.0
dtype: float64

In [22]:
obj.index == index

array([ True,  True,  True], dtype=bool)

In [23]:
obj.index is index

True

In [24]:
2001 in frame3.index

True

## 两个索引之间的操作

In [25]:
index1 = pd.Index(np.arange(3))

In [26]:
index2 = pd.Index([2,3,4])

In [27]:
index2.append(index1)

Int64Index([2, 3, 4, 0, 1, 2], dtype='int64')

In [28]:
index1.diff(index2)

AttributeError: 'Int64Index' object has no attribute 'diff'

In [29]:
index1.union(index2)

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [30]:
index2.union(index1)#自动排序

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [31]:
index1.intersection(index2)

Int64Index([2], dtype='int64')

In [32]:
index1.isin([1,2])

array([False,  True,  True], dtype=bool)

In [33]:
index1.delete(1)

Int64Index([0, 2], dtype='int64')

In [34]:
index1.delete([0,1])

Int64Index([2], dtype='int64')

In [36]:
index1.insert(1,19)

Int64Index([0, 19, 1, 2], dtype='int64')

In [37]:
index3 = index1.insert(1,1)
index3

Int64Index([0, 1, 1, 2], dtype='int64')

In [38]:
index3.unique()

Int64Index([0, 1, 2], dtype='int64')

## reindex 重新索引

In [39]:
obj = Series([4.5, 7.3, -5.3 , 3.6 ], index=['d','b','a','c'])

In [40]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [41]:
obj2

a   -5.3
b    7.3
c    3.6
d    4.5
e    NaN
dtype: float64

In [42]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.3
c    3.6
d    4.5
e    0.0
dtype: float64

In [43]:
obj3 = Series(['blue' , 'purple' ,'yellow'],index = [0,2,4])

In [44]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [45]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [46]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a', 'b', 'd'], columns=['Ohio','Texas','California'])

In [47]:
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
d     6      7           8

In [48]:
frame.reindex(['a','b','c','d'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   NaN    NaN         NaN
d   6.0    7.0         8.0

In [49]:
states = ['Texas','Utah','California']

In [50]:
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
d      7   NaN           8

In [52]:
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
d     6      7           8

In [51]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill', columns=states )

ValueError: index must be monotonic increasing or decreasing

In [53]:
frame.ix[['a', 'b', 'c', 'd'] , states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    4.0   NaN         5.0
c    NaN   NaN         NaN
d    7.0   NaN         8.0

In [54]:
_.ffill()

   Texas  Utah  California
a    1.0   NaN         2.0
b    4.0   NaN         5.0
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [55]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd','e'])

In [56]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [57]:
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [71]:
data = DataFrame(
    np.arange(16).reshape((4,4)),
    index=['Ohio', 'Colifornia', 'Utah', 'New York'],
    columns=['one','two','three','four']
)

In [72]:
data

            one  two  three  four
Ohio          0    1      2     3
Colifornia    4    5      6     7
Utah          8    9     10    11
New York     12   13     14    15

In [73]:
data.drop(['Ohio','Utah'])

            one  two  three  four
Colifornia    4    5      6     7
New York     12   13     14    15

In [74]:
data

            one  two  three  four
Ohio          0    1      2     3
Colifornia    4    5      6     7
Utah          8    9     10    11
New York     12   13     14    15

In [63]:
del data['four']

In [75]:
data

            one  two  three  four
Ohio          0    1      2     3
Colifornia    4    5      6     7
Utah          8    9     10    11
New York     12   13     14    15

In [76]:
data.drop('two',axis = 1)

            one  three  four
Ohio          0      2     3
Colifornia    4      6     7
Utah          8     10    11
New York     12     14    15

In [77]:
data

            one  two  three  four
Ohio          0    1      2     3
Colifornia    4    5      6     7
Utah          8    9     10    11
New York     12   13     14    15

In [78]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [79]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [80]:
obj['b']

1.0

In [82]:
obj[2:4]  #Python方式的切片

c    2.0
d    3.0
dtype: float64

In [83]:
obj['a':'b'] #利用标签的切片方式

a    0.0
b    1.0
dtype: float64

In [84]:
data

            one  two  three  four
Ohio          0    1      2     3
Colifornia    4    5      6     7
Utah          8    9     10    11
New York     12   13     14    15

In [85]:
data[data['one']>5]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [108]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [109]:
s2 = Series([4.3, 1.3, -1.5, 3.4, 1.5], index=['a', 'c', 'e', 'f', 'g'])

In [110]:
s1+s2

a    11.6
c    -1.2
d     NaN
e     0.0
f     NaN
g     NaN
dtype: float64

In [111]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))

In [112]:
df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))

In [113]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [114]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [115]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [116]:
df1.add(df2 ,fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [117]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0